[
    {
        "name": "Higantes Festival",
        "address": "Angono, Rizal",
        "description": "Every November, the town bursts into life with the Higantes Festival—a vibrant celebration that transforms the streets into an outdoor gallery of towering papier‑mâché giants (locally known as “higantes”). These colossal figures, often over ten feet tall, are paraded through the town alongside street dancing, music, and displays that blend history with local humor and artistry. Rooted in tradition and reflecting the town’s spirit during the Spanish colonial era, this festival stands as a vivid storytelling celebration of Angono’s cultural identity.",
        "image": "images/expo.webp"
    },
    {
        "name": "Angono Petroglyphs",
        "address": "Col. Guido Road, Binangonan, Rizal",
        "description": "Step back into time at one of the Philippines’ most ancient art sites—the  . Discovered in 1965, these rock engravings, which date back to around 3000 B.C., provide an intriguing glimpse of early Filipino artistic expression. Nestled amidst lush surroundings, this archaeological wonder not only captivates art enthusiasts but also historians yearning to connect with the nation’s distant past.",
        "image": "images/forum.webp"
    },
    {
        "name": "Art Exhibits and Cultural Performances",
        "address": "Angono, Rizal",
        "description": "As the Art Capital of the Philippines, Angono, Rizal takes the opportunity during the festival to showcase its artistic talents. Throughout the festival, visitors can explore art exhibits featuring works by local artists, including paintings, sculptures, and mixed-media installations inspired by the town’s rich history.",
        "image": "images/job-fair.webp"
    },
    {
        "name": " ",
        "address": " ",
        "description": " ",
        "image": "images/luncheon.webp"
    },
    {
        "name": " ",
        "address": " ",
        "description": " ",
        "image": "images/metro-manila.webp"
    },
    {
        "name": " ",
        "address": " ",
        "description": " ",
        "image": "images/see.webp"
    },
    {
        "name": " ",
        "address": " ",
        "description": " ",
        "image": "images/"
    },
    {
        "name": " ",
        "address": " ",
        "description": " ",
        "image": "images/"
    },
    {
        "name": " ",
        "address": " ",
        "description": " ",
        "image": "images/"
    }
]